[
  {
    "Date": "Feb 25th 2018",
    "Title": "Desktop version of Softozor website available",
    "Description":
      "The first production version of our website has been released. Our totally \"non-serious\" game in the banner is up and running except for a few little cosmetic details. Though it is looking nice on Desktop computers, it's a bit too early to browse it with a mobile device as none of it has been adapted for smaller screens yet. Because our current small team is already fully focused on on-going projects, you will unfortunately need to wait a bit more to use our website on your favorite mobile device."
  },
  {
    "Date": "Feb 1st 2018",
    "Title": "Initialized investigations of the Shopozor project",
    "Description":
      "Farmers and artisans in our neighbourhood brought to our attention that they are unhappy with the commercial platform they are using to share products as it is managed by people in another country which tax them too much for the service. We are starting investigating that problem from a consulting point of view in order to address the various possibilities. One of them is that we build up our own platform with yet unseen functionalities that will make our local artisans' lives far easier."
  },
  {
    "Date": "Nov 1st 2017",
    "Title": "Initialized the Softozor Website project",
    "Description":
      "The aim of the website is to present our team and products. A basic version will be ready for 2018."
  },
  {
    "Date": "Sep 30th 2017",
    "Title": "Produced first Fotozor",
    "Description":
      "The complete photo booth's cabin and software application are ready. The first instance of this Fotozor was called \"Choupimaton\" after the nicknames of the wedding's groom and bride. The Fotozor is customizable for anybody interested and is available for rent. Please feel free to contact us if you need more details on that product."
  },
  {
    "Date": "Aug 15th 2017",
    "Title": "Initialized the Fotozor project",
    "Description":
      "For the wedding of one of us, someone came up with the crazy idea to build a complete photo booth from A to Z. Challenge accepted."
  },
  {
    "Date": "July 14th 2017",
    "Title": "Founded Softozor",
    "Description":
      "Softozor was born during one of our numerous after-work cocktails. We have been nourishing the idea of collaborating on professional projects for a long time."
  }
]
