[
  {
    "Date": "June 30th 2018",
    "Title": "First rental of our Fotozor under the code name 'Micmacmaton'",
    "Description": "<p>The event \"Mic mac dans les contes\" organized by <a href='https://www.petit-theatre-siviriez.ch/' target='_blank'>Le Petit Th&eacute;&acirc;tre de Siviriez</a> show-cased the 'Micmacmaton' instance of our Fotozor in Villaraboud.</p> <p> <img align='center' src='../assets/news/micmacmaton.jpeg'></p>"
  },
  {
    "Date": "May 24th 2018",
    "Title": "Shopozor's development applications made available online for our stakeholders",
    "Description": "The initial commits to our repositories were performed today. Our private repositories are automatically deployed onto heroku: you can find our <a href='http://shopozor-server.herokuapp.com' target='_blank'>server application</a> as well as our <a href='http://shopozor-client.herokuapp.com' target='_blank'>client application</a>. The development is on-going which means that the design of both applications is far from being done. We also decided to base our system on the graph database developed by <a href='http://www.neo4j.com' target='_blank'>neo4j</a>."
  },
  {
    "Date": "May 15th 2018",
    "Title": "First meeting with the Shopozor's stakeholders",
    "Description": "We held our first meeting with the stakeholders of the project in the restaurant \"La Pinte\" in Farvagny. There we got contact with a dozen people interested in the up-coming software. The discussions were very interesting and we were able to take important needs into account. We also did a first demonstration of our Shopozor!"
  },
  {
    "Date": "May 14th 2018",
    "Title": "First governance meeting",
    "Description": "As a new team member will join us, we need to address a few questions related to our internal governance, like role assignments, potentially new roles definition, finance, and overall strategy."
  },
  {
    "Date": "Apr 3rd 2018",
    "Title": "Development environment ready for the Shopozor project",
    "Description":
      "We are done clarifying what technologies we will go for in this project. Our apps' development builds will be regularly deployed on <a href='http://www.heroku.com' target='_blank'>Heroku</a> as it offers free hosting for NodeJS applications. Our backend application will base on <a href='http://www.prisma.io' target='_blank'>PrismaJS</a> for the database API. Our frontend application will be written with the <a href='https://reactjs.org' target='_blank'>ReactJS</a> library. We will give <a href='https://www.apollographql.com/' target='_blank'>Apollo</a> a shot for client - server communications as well as internal state management."
  },
  {
    "Date": "Mar 11th 2018",
    "Title": "Production of the Shopozor's initial product backlog",
    "Description":
      "We have now gathered enough information about what our customer and his artisans want to have in their application. We are now initializing its initial product backlog."
  },
  {
    "Date": "Mar 10th 2018",
    "Title": "Mobile version of Softozor website available",
    "Description":
      "The first production version of our mobile website has been released. Up to a few minor problems with the game on some browsers, you should now enjoy navigating on our application with your mobile device."
  },
  {
    "Date": "Feb 25th 2018",
    "Title": "Desktop version of Softozor website available",
    "Description":
      "The first production version of our website has been released. Our totally \"non-serious\" game in the banner is up and running except for a few little cosmetic details. Though it is looking nice on Desktop computers, it's a bit too early to browse it with a mobile device as none of it has been adapted for smaller screens yet. Because our current small team is already fully focused on on-going projects, you will unfortunately need to wait a bit more to use our website on your favorite mobile device."
  },
  {
    "Date": "Feb 1st 2018",
    "Title": "Initialized investigations of the Shopozor project",
    "Description":
      "Farmers and artisans in our neighbourhood brought to our attention that they are unhappy with the commercial platform they are using to share products as it is managed by people in another country which tax them too much for the service. We are starting investigating that problem from a consulting point of view in order to address the various possibilities. One of them is that we build up our own platform with yet unseen functionalities that will make our local artisans' lives far easier."
  },
  {
    "Date": "Nov 1st 2017",
    "Title": "Initialized the Softozor Website project",
    "Description":
      "The aim of the website is to present our team and products. A basic version will be ready for 2018."
  },
  {
    "Date": "Sep 30th 2017",
    "Title": "Produced first Fotozor",
    "Description":
      "The complete photo booth's cabin and software application are ready. The first instance of this Fotozor was called \"Choupimaton\" after the nicknames of the wedding's groom and bride. The Fotozor is customizable for anybody interested and is available for rent. Please feel free to contact us if you need more details on that product."
  },
  {
    "Date": "Aug 15th 2017",
    "Title": "Initialized the Fotozor project",
    "Description":
      "For the wedding of one of us, someone came up with the crazy idea to build a complete photo booth from A to Z. Challenge accepted."
  },
  {
    "Date": "July 14th 2017",
    "Title": "Founded Softozor",
    "Description":
      "Softozor was born during one of our numerous after-work cocktails. We have been nourishing the idea of collaborating on professional projects for a long time."
  }
]
